# GetCurvesAndEdgesReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..GetCurvesAndEdgesReference Method
Form Class See Also
---
Given a point, return all edges and curves that it is lying on.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ReferenceArray GetCurvesAndEdgesReference(
	Reference pointReference
)
```

Visual Basic
---
```text
Public Function GetCurvesAndEdgesReference ( _
	pointReference As Reference _
) As ReferenceArray
```

Visual C++
---
```text
public:
ReferenceArray^ GetCurvesAndEdgesReference(
	Reference^ pointReference
)
```

# ### Parameters
pointReference
    Type: Autodesk.Revit.DB..::..ReferenceThe reference of a point.
# ### Return Value
Reference array containing all edges and curves that the point is lying on.
# See Also
Form Class
Autodesk.Revit.DB Namespace